#Область ПрограммныйИнтерфейс

Функция ТестДолжен_1() Экспорт

	ФункцияФильтрации = ПроцессорыКоллекций.НовыйОписаниеОповещения("ОбработчикФильтрации", тест_ПроцессорыКоллекций);
	ФункцияОбработки  = ПроцессорыКоллекций.НовыйОписаниеОповещения("ОбработчикОбработки",  тест_ПроцессорыКоллекций);
	
	ПроцессорКоллекций = ПроцессорыКоллекций.НовыйПроцессорКоллекций();
	ПроцессорКоллекций.УстановитьКоллекцию(ПолучитьНачальныйМассив());

	Результат = ПроцессорКоллекций
		.Пропустить(2)
		.Фильтровать(ФункцияФильтрации)
		.Первые(2)
		.Обработать(ФункцияОбработки)
		.Получить(Тип("Массив"));

	Возврат Результат;
	
КонецФункции

Функция ТестДолжен_2() Экспорт

	ПроцессорКоллекций = ПроцессорыКоллекций.ИзКоллекции(ПолучитьНачальныйМассив());
	Результат = ПроцессорКоллекций
		.Сортировать()
		.ВМассив();

	Возврат Результат;

КонецФункции

Функция ТестДолжен_3() Экспорт
	
	ФункцияОбработки  = ПроцессорыКоллекций.НовыйОписаниеОповещения("ОбработчикОбработки",  тест_ПроцессорыКоллекций);
	ФункцияСокращения = ПроцессорыКоллекций.НовыйОписаниеОповещения("ОбработчикСокращения", тест_ПроцессорыКоллекций);

	ПроцессорКоллекций = ПроцессорыКоллекций.ИзКоллекции(ПолучитьНачальныйМассив());
	Результат = ПроцессорКоллекций
		.Обработать(ФункцияОбработки)
		.Сократить(ФункцияСокращения, 0);

	Возврат Результат;

КонецФункции

Функция ТестДолжен_4() Экспорт

	// Результат должен различаться
	Результат = ПроцессорыКоллекций
		.ИзКоллекции(ПолучитьНачальныйМассив())
		.Сортировать()
		.Первые(1)
		.Получить("Массив");
	
	Возврат Результат;
	
КонецФункции

Функция ТестДолжен_5() Экспорт
	Строка = "ФЫВА";
	Результат = ПроцессорыКоллекций
		.ИзСтроки(Строка)
		.Сортировать()
		.ВСтроку();
	
	Возврат Результат;
	
КонецФункции

Функция ТестДолжен_6() Экспорт

	Строка = "Я строка с пробелами";
	Результат = ПроцессорыКоллекций
		.ИзСтроки(Строка, " ")
		.ВСтроку();
	
	Возврат Результат;

КонецФункции

Функция ТестДолжен_7() Экспорт
	
	Строка = "Я
	|строка
	|многострочная";

	Результат = ПроцессорыКоллекций
		.ИзСтроки(Строка, Символы.ПС)
		.Сортировать()
		.ВСтроку(Символы.ПС);
	
	Возврат Результат;

КонецФункции

Функция ТестДолжен_8() Экспорт

	Строка = "Я
	|строка
	|многострочная";

	Результат = ПроцессорыКоллекций
		.ИзСтроки(Строка, Символы.ПС)
		.Фильтровать("Результат = СтрДлина(Элемент) > 1")
		.ВСтроку(Символы.ПС);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработчикФильтрации(Результат, ДополнительныеПараметры) Экспорт
	Элемент = ДополнительныеПараметры.Элемент;
	Результат = Элемент > 3;
КонецПроцедуры

Процедура ОбработчикОбработки(Результат, ДополнительныеПараметры) Экспорт
	Элемент = ДополнительныеПараметры.Элемент;
	Результат = Элемент + 1;
КонецПроцедуры

Процедура ОбработчикСокращения(Результат, ДополнительныеПараметры) Экспорт
	Элемент = ДополнительныеПараметры.Элемент;
	Результат = Результат + Элемент;
КонецПроцедуры

Функция ПолучитьНачальныйМассив() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(3);
	Массив.Добавить(4);
	Массив.Добавить(7);
	Массив.Добавить(5);
	Массив.Добавить(1);
	Массив.Добавить(0);
	
	Возврат Массив;
	
КонецФункции

Функция ПолучитьПроцессорКоллекций()
	
	Возврат ПроцессорыКоллекций.ИзКоллекции(ПолучитьНачальныйМассив());
	
КонецФункции

#КонецОбласти
