#Область ОбъявлениеПеременных

&НаКлиенте
Перем КонтекстЯдра; // Фреймворк тестирования
&НаКлиенте
Перем Ожидаем;      // Ассерты

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область СобытияФреймворкаТестирования

&НаКлиенте
Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем      = КонтекстЯдра.Плагин("УтвержденияBDD");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаборТестов(НаборТестов, КонтекстЯдраПараметр) Экспорт
	
	КонтекстЯдра = КонтекстЯдраПараметр;
	
	НаборТестов.Добавить("ТестДолжен_ПроинициализироватьПроцессорКоллекций");
	НаборТестов.Добавить("ТестДолжен_ПроинициализироватьПроцессорКоллекцийЧерезПомощник");
	НаборТестов.Добавить("ТестДолжен_ПроинициализироватьПроцессорКоллекцийИзСтрокиЧерезПомощник");
	НаборТестов.Добавить("ТестДолжен_ПроинициализироватьПроцессорКоллекцийИзНабораЧерезПомощник");
	
КонецПроцедуры

#КонецОбласти

#Область Тесты

&НаКлиенте
Процедура ТестДолжен_ПроинициализироватьПроцессорКоллекций() Экспорт
	ПроцессорКоллекций = ПроцессорыКоллекций.НовыйПроцессорКоллекций();
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ПроинициализироватьПроцессорКоллекцийЧерезПомощник() Экспорт
	ПроцессорКоллекций = ПроцессорыКоллекций.ИзКоллекции(Новый Массив);
	
	Если ТипЗнч(ПроцессорКоллекций) <> Тип("ФормаКлиентскогоПриложения") Тогда
		ВызватьИсключение "Ожидали что ПроцессорКоллекций Имеет тип ФормаКлиентскогоПриложения, а это не так";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ПроинициализироватьПроцессорКоллекцийИзСтрокиЧерезПомощник() Экспорт
	ПроцессорКоллекций = ПроцессорыКоллекций.ИзСтроки("");
	
	Если ТипЗнч(ПроцессорКоллекций) <> Тип("ФормаКлиентскогоПриложения") Тогда
		ВызватьИсключение "Ожидали что ПроцессорКоллекций Имеет тип ФормаКлиентскогоПриложения, а это не так";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ПроинициализироватьПроцессорКоллекцийИзНабораЧерезПомощник() Экспорт
	ПроцессорКоллекций = ПроцессорыКоллекций.ИзНабора(1, 2, 3);
	
	Если ТипЗнч(ПроцессорКоллекций) <> Тип("ФормаКлиентскогоПриложения") Тогда
		ВызватьИсключение "Ожидали что ПроцессорКоллекций Имеет тип ФормаКлиентскогоПриложения, а это не так";
	КонецЕсли;
	
	Ожидаем.Что(ПроцессорКоллекций.Количество()).Равно(3);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
