#Область ОбъявлениеПеременных

&НаКлиенте
Перем КонтекстЯдра; // Фреймворк тестирования
&НаКлиенте
Перем Ожидаем;      // Ассерты

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область СобытияФреймворкаТестирования

&НаКлиенте
Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем      = КонтекстЯдра.Плагин("УтвержденияBDD");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаборТестов(НаборТестов, КонтекстЯдраПараметр) Экспорт
	
	КонтекстЯдра = КонтекстЯдраПараметр;
	
	НаборТестов.Добавить("ТестДолжен_ПолучитьПроцессорКоллекцииИзЗаполненнойСтроки");
	НаборТестов.Добавить("ТестДолжен_ПолучитьПроцессорКоллекцииИзЗаполненнойСтрокиСРазделителем");
	НаборТестов.Добавить("ТестДолжен_ДолженВернутьСтрокуИзСтроки");
	НаборТестов.Добавить("ТестДолжен_ДолженВернутьСтрокуСРазделителемИзСтроки");
	
КонецПроцедуры

#КонецОбласти

#Область Тесты

&НаКлиенте
Процедура ТестДолжен_ПолучитьПроцессорКоллекцииИзЗаполненнойСтроки() Экспорт
	ПроцессорКоллекций = ПроцессорыКоллекций.ИзСтроки("123");
	Результат = ПроцессорКоллекций.ВМассив();
	Ожидаем.Что(Результат).ИмеетДлину(3);
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ПолучитьПроцессорКоллекцииИзЗаполненнойСтрокиСРазделителем() Экспорт
	ПроцессорКоллекций = ПроцессорыКоллекций.ИзСтроки("1 2 3", " ");
	Результат = ПроцессорКоллекций.ВМассив();
	Ожидаем.Что(Результат).ИмеетДлину(3);
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ДолженВернутьСтрокуИзСтроки() Экспорт
	ПроцессорКоллекций = ПроцессорыКоллекций.ИзСтроки("1 2 3", " ");
	Результат = ПроцессорКоллекций.ВСтроку();
	Ожидаем.Что(Результат).ИмеетДлину(3);
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ДолженВернутьСтрокуСРазделителемИзСтроки() Экспорт
	ПроцессорКоллекций = ПроцессорыКоллекций.ИзСтроки("1 2 3", " ");
	Результат = ПроцессорКоллекций.ВСтроку(" ");
	Ожидаем.Что(Результат).ИмеетДлину(5);
КонецПроцедуры

#КонецОбласти

#КонецОбласти
