#Область ОбъявлениеПеременных

&НаКлиенте
Перем КонтекстЯдра; // Фреймворк тестирования
&НаКлиенте
Перем Ожидаем;      // Ассерты

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область СобытияФреймворкаТестирования

&НаКлиенте
Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем      = КонтекстЯдра.Плагин("УтвержденияBDD");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаборТестов(НаборТестов, КонтекстЯдраПараметр) Экспорт
	
	КонтекстЯдра = КонтекстЯдраПараметр;
	
	НаборТестов.Добавить("ТестДолжен_ПолучитьПервый");
	НаборТестов.Добавить("ТестДолжен_ВернутьМассив");
	НаборТестов.Добавить("ТестДолжен_ВернутьСтроку");
	НаборТестов.Добавить("ТестДолжен_ПолучитьКоличество");
	НаборТестов.Добавить("ТестДолжен_ВыполнитьДляКаждого");
	НаборТестов.Добавить("ТестДолжен_ПолучитьМинимальныйЭлемент");
	НаборТестов.Добавить("ТестДолжен_ПолучитьМаксимальныйЭлемент");
	НаборТестов.Добавить("ТестДолжен_ВыполнитьСокращение");
	НаборТестов.Добавить("ТестДолжен_ПолучитьМассив");
	// НаборТестов.Добавить("ТестДолжен_ПолучитьТаблицуЗначений"); // На клиенте самолёт не полетит
	НаборТестов.Добавить("ТестДолжен_ПолучитьСписокЗначений");
	НаборТестов.Добавить("ТестДолжен_ПроверитьЛюбойСоответствует");
	НаборТестов.Добавить("ТестДолжен_ПроверитьВсеСоответствуют");
	НаборТестов.Добавить("ТестДолжен_ПроверитьВсеНеСоответствуют");
	НаборТестов.Добавить("ТестДолжен_ПроверитьПробросДополнительныхПараметровВОповещениеДляКаждого");
	
	// НаборТестов.Добавить("ТестДолжен_ПолучитьСтруктуру");
	// НаборТестов.Добавить("ТестДолжен_ПолучитьСоответствие");
	
КонецПроцедуры

#КонецОбласти

#Область Тесты

&НаКлиенте
Процедура ТестДолжен_ПолучитьПервый() Экспорт
	ПроцессорКоллекций = ПолучитьПроцессорКоллекций();
	Результат = ПроцессорКоллекций.ПолучитьПервый();
	Ожидаем.Что(Результат).ИмеетТип("Число").Равно(1);
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ВернутьМассив() Экспорт
	ПроцессорКоллекций = ПолучитьПроцессорКоллекций();
	Результат = ПроцессорКоллекций.ВМассив();
	Ожидаем.Что(Результат).ИмеетТип("Массив").ИмеетДлину(6);
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ВернутьСтроку() Экспорт
	ПроцессорКоллекций = ПолучитьПроцессорКоллекций();
	Результат = ПроцессорКоллекций.ВСтроку();
	Ожидаем.Что(Результат).ИмеетТип("Строка").ИмеетДлину(6);
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ПолучитьКоличество() Экспорт
	ПроцессорКоллекций = ПолучитьПроцессорКоллекций();
	Результат = ПроцессорКоллекций.Количество();
	Ожидаем.Что(Результат).Равно(6);
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ВыполнитьДляКаждого() Экспорт
	ПроцессорКоллекций = ПолучитьПроцессорКоллекций();
	НачальныйМассив = ПолучитьНачальныйМассив();

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВнешнийМассив", Новый Массив);
	ПроцессорКоллекций.ДляКаждого("ДополнительныеПараметры.ВнешнийМассив.Добавить(Элемент + 1)", ДополнительныеПараметры);
	Ожидаем.Что(ДополнительныеПараметры.ВнешнийМассив).ИмеетДлину(НачальныйМассив.Количество());
	Для сч = 0 По ДополнительныеПараметры.ВнешнийМассив.ВГраница() Цикл
		Ожидаем.Что(ДополнительныеПараметры.ВнешнийМассив[сч]).Равно(НачальныйМассив[сч] + 1);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ПолучитьМинимальныйЭлемент() Экспорт
	ПроцессорКоллекций = ПолучитьПроцессорКоллекций();
	Результат = ПроцессорКоллекций.Минимум();
	Ожидаем.Что(Результат).Равно(0);
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ПолучитьМаксимальныйЭлемент() Экспорт
	ПроцессорКоллекций = ПолучитьПроцессорКоллекций();
	Результат = ПроцессорКоллекций.Максимум();
	Ожидаем.Что(Результат).Равно(3);
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ВыполнитьСокращение() Экспорт
	ПроцессорКоллекций = ПолучитьПроцессорКоллекций();
	
	Результат = ПроцессорКоллекций.Сократить("Результат = Результат + Элемент", 0);
	Ожидаем.Что(Результат).Равно(10);
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ПолучитьМассив() Экспорт
	ПроцессорКоллекций = ПолучитьПроцессорКоллекций();
	НачальныйМассив = ПолучитьНачальныйМассив();

	Результат = ПроцессорКоллекций.Получить(Тип("Массив"));
	Ожидаем.Что(Результат).ИмеетТип("Массив").ИмеетДлину(НачальныйМассив.Количество());

	Для сч = 0 По НачальныйМассив.ВГраница() Цикл
		Ожидаем.Что(НачальныйМассив[сч]).Равно(Результат[сч]);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ПолучитьСписокЗначений() Экспорт
	ПроцессорКоллекций = ПолучитьПроцессорКоллекций();
	НачальныйМассив = ПолучитьНачальныйМассив();
	
	Результат = ПроцессорКоллекций.Получить(Тип("СписокЗначений"));
	Ожидаем.Что(Результат).ИмеетТип("СписокЗначений").ИмеетДлину(НачальныйМассив.Количество());
	
	Для сч = 0 По НачальныйМассив.ВГраница() Цикл
		Ожидаем.Что(НачальныйМассив[сч]).Равно(Результат[сч].Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ПолучитьСтруктуру() Экспорт
	ПроцессорКоллекций = ПолучитьПроцессорКоллекций();
	НачальныйМассив = ПолучитьНачальныйМассив();
	
	Результат = ПроцессорКоллекций.Получить(Тип("Структура"));
	Ожидаем.Что(Результат).ИмеетТип("Структура").ИмеетДлину(НачальныйМассив.Количество());
	
	Для сч = 0 По НачальныйМассив.ВГраница() Цикл
		Ожидаем.Что(НачальныйМассив[сч]).Равно(Результат[сч].Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ПолучитьСоответствие() Экспорт
	ПроцессорКоллекций = ПолучитьПроцессорКоллекций();
	НачальныйМассив = ПолучитьНачальныйМассив();
	
	Результат = ПроцессорКоллекций.Получить(Тип("Соответствие"));
	Ожидаем.Что(Результат).ИмеетТип("Соответствие").ИмеетДлину(НачальныйМассив.Количество());
	
	Для сч = 0 По НачальныйМассив.ВГраница() Цикл
		Ожидаем.Что(НачальныйМассив[сч]).Равно(Результат[сч].Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ПроверитьЛюбойСоответствует() Экспорт
	ПроцессорКоллекций = ПолучитьПроцессорКоллекций();
	
	Результат = ПроцессорКоллекций.ЛюбойСоответствует("Результат = Элемент > 1");
	Ожидаем.Что(Результат).ЭтоИстина();
	
	Результат = ПроцессорКоллекций.ЛюбойСоответствует("Результат = Элемент < 0");
	Ожидаем.Что(Результат).ЭтоЛожь();
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ПроверитьВсеСоответствуют() Экспорт
	ПроцессорКоллекций = ПолучитьПроцессорКоллекций();
	
	Результат = ПроцессорКоллекций.ВсеСоответствуют("Результат = Элемент >= 0");
	Ожидаем.Что(Результат).ЭтоИстина();
	
	Результат = ПроцессорКоллекций.ВсеСоответствуют("Результат = Элемент < 2");
	Ожидаем.Что(Результат).ЭтоЛожь();
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ПроверитьВсеНеСоответствуют() Экспорт
	ПроцессорКоллекций = ПолучитьПроцессорКоллекций();
	
	Результат = ПроцессорКоллекций.ВсеНеСоответствуют("Результат = Элемент < 0");
	Ожидаем.Что(Результат).ЭтоИстина();
	
	Результат = ПроцессорКоллекций.ВсеНеСоответствуют("Результат = Элемент > 2");
	Ожидаем.Что(Результат).ЭтоЛожь();
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ПроверитьПробросДополнительныхПараметровВОповещениеДляКаждого() Экспорт
	ПроцессорКоллекций = ПолучитьПроцессорКоллекций();
	
	ДополнительныеПараметры = Новый Структура("ПроверяемыйПараметр");
	ФункцияОбработки = ПроцессорыКоллекций.НовыйОписаниеОповещения(
		"ФункцияОбработкиСПроверкойДопПараметров",
		ЭтотОбъект,
		ДополнительныеПараметры
	);

	// Ожидаем, что все варианты не выкинут исключения
	ПроцессорКоллекций.ДляКаждого(ФункцияОбработки);
	ПроцессорКоллекций.ДляКаждого("Результат = ДополнительныеПараметры.ПроверяемыйПараметр;", ДополнительныеПараметры);

	ФункцияОбработки = ПроцессорыКоллекций.НовыйОписаниеОповещения(
		"ФункцияОбработкиСПроверкойДопПараметров",
		ЭтотОбъект
	);
	ПроцессорКоллекций.ДляКаждого(ФункцияОбработки, ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПолучитьНачальныйМассив()
	Массив = Новый Массив;
	Массив.Добавить(1);
	Массив.Добавить(0);
	Массив.Добавить(3);
	Массив.Добавить(2);
	Массив.Добавить(3);
	Массив.Добавить(1);

	Возврат Массив;
КонецФункции

&НаКлиенте
Функция ПолучитьПроцессорКоллекций()

	Возврат ПроцессорыКоллекций.ИзКоллекции(ПолучитьНачальныйМассив());

КонецФункции

&НаКлиенте
Процедура ФункцияОбработкиСПроверкойДопПараметров(Результат, ДополнительныеПараметры) Экспорт
	Результат = ДополнительныеПараметры.ПроверяемыйПараметр;
КонецПроцедуры

#КонецОбласти
