#Область ОписаниеПеременных

Перем КонтекстЯдра; // Фреймворк тестирования
Перем Ожидаем;      // Ассерты

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область СобытияФреймворкаТестирования

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем      = КонтекстЯдра.Плагин("УтвержденияBDD");
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов, КонтекстЯдраПараметр) Экспорт
	
	КонтекстЯдра = КонтекстЯдраПараметр;
	
	НаборТестов.Добавить("ТестДолжен_ПроинициализироватьПроцессорКоллекций");
	НаборТестов.Добавить("ТестДолжен_ПроинициализироватьПроцессорКоллекцийЧерезПомощник");
	НаборТестов.Добавить("ТестДолжен_ПроинициализироватьПроцессорКоллекцийИзСтрокиЧерезПомощник");
	НаборТестов.Добавить("ТестДолжен_ПроинициализироватьПроцессорКоллекцийИзНабораЧерезПомощник");
	
КонецПроцедуры

#КонецОбласти

#Область Тесты

Процедура ТестДолжен_ПроинициализироватьПроцессорКоллекций() Экспорт
	ПроцессорКоллекций = ПроцессорыКоллекций.НовыйПроцессорКоллекций();
КонецПроцедуры

Процедура ТестДолжен_ПроинициализироватьПроцессорКоллекцийЧерезПомощник() Экспорт
	ПроцессорКоллекций = ПроцессорыКоллекций.ИзКоллекции(Новый Массив);
	Ожидаем.Что(ПроцессорКоллекций).ИмеетТип("ОбработкаОбъект.ПроцессорКоллекций");
КонецПроцедуры

Процедура ТестДолжен_ПроинициализироватьПроцессорКоллекцийИзСтрокиЧерезПомощник() Экспорт
	ПроцессорКоллекций = ПроцессорыКоллекций.ИзСтроки("");
	Ожидаем.Что(ПроцессорКоллекций).ИмеетТип("ОбработкаОбъект.ПроцессорКоллекций");
КонецПроцедуры

Процедура ТестДолжен_ПроинициализироватьПроцессорКоллекцийИзНабораЧерезПомощник() Экспорт
	ПроцессорКоллекций = ПроцессорыКоллекций.ИзНабора(1, 2, 3);
	Ожидаем.Что(ПроцессорКоллекций).ИмеетТип("ОбработкаОбъект.ПроцессорКоллекций");
	Ожидаем.Что(ПроцессорКоллекций.Количество()).Равно(3);
КонецПроцедуры

#КонецОбласти

#КонецОбласти
